export const LOGIN_ERROR =
    ' от 3 до 20 символов, латиница, может содержать цифры, но не состоять из них, без пробелов, без спецсимволов';
export const SECOND_NAME_ERROR =
    'латиница или кириллица, первая буква должна быть заглавной, без пробелов и без цифр, нет спецсимволов (допустим только дефис).';
export const FIRST_NAME_ERROR = SECOND_NAME_ERROR;
export const EMAIL_ERROR =
    ' латиница, может включать цифры и спецсимволы вроде дефиса, обязательно должна быть «собака» (@) и точка после неё, но перед точкой обязательно должны быть буквы';
export const PASSWORD_ERROR =
    'от 8 до 40 символов, обязательно хотя бы одна заглавная буква и цифра.';
export const PHONE_ERROR =
    ' от 10 до 15 символов, состоит из цифр, может начинается с плюса';
export const CHAT_LOGIN_ERROR = 'Error in chat';
